#include <iostream>

// فرض کنید سنسور دمایی از 0 الی 100 درجه را اندازه می گیرد
// خروجی سنسور ولتاژی است بین 0 الی 5
// با گرفتن ولتاژ بگویید دما چقدر است
// همچنین اگر دما بالایی 50 درجه شد پیام هوای گرم را چاپ کنید


using namespace std;

int main()
{
    // تعریف متغیر ولتاژ دریافتی از ورودی
    float v;
    //تعریف متغیرجهت ذخیره دما
    float temp;
    //دریافت ولتاژ از ورودی
    cin >> v;
    // محاسبه دما به درجه
    temp = (100 * v) / 5;
    // نمایش دمای محاسبه شده
    cout << "Temp:" << temp << endl;
    // شرط برای نمایش هشدار بالای 50 درجه
    if(temp >= 50) {
        cout << "High Temp";
    }
    return 0;
}
