#include <iostream>
// یک سنسور داریم که دمای بین -10 الی 100 درجه را اندازه می گیرد و خروجی ولتاژی دارد
// چنانچه ورودی دما باشد ولتاژ را  با برنامه نویسی محاسبه کنید.
// ولتاژ خروجی عددی است بین صفر الی 5 ولت
// باتو به اینکه مدار به ولتاژ بالای سه ولت حساس است  با وارد شدن ولتاژ زیاد یک پیام نیز چاگ کنید
using namespace std;

int main()
{
    int x; // دمای ورودی
    float v; //ولتاژ سنسور

    cin >> x;
    v = (5 * x) / 110.0;
    cout << v;
    if(v >= 3)
    {
        cout << "High Voltage";
    }
    return 0;
}
